{
  "정보처리기사": [
    {
      "infoTime": "2022년 1회",
      "infoNumber": "20220305",
      "infoQuestion": "User Interface 설계 시 오류 메시지나 경고에 관한 지침으로 가장 거리가 먼 것은?",
      "infoChoice": [" 메시지는 이해하기 쉬워야 한다.", " 오류로부터 회복을 위한 구체적인 설명이 제공되어야 한다", "오류로 인해 발생 될 수 있는 부정적인 내용을 적극적으로 사용자들에게 알려야 한다.", "소리나 색의 사용을 줄이고 텍스트로만 전달하도록 한다."],
      "infoAnswer": "소리나 색의 사용을 줄이고 텍스트로만 전달하도록 한다.",
      "infoDesc": "특정 위험 또는 오류를 연상시키는 색깔의 사용은 상식적으로 직관성을 높이는 수단이 될 것이다."
    },
    {
      "infoTime": "2022년 1회",
      "infoNumber": "20220305",
      "infoQuestion": " 다음 중 애자일(Agile) 소프트웨어 개발에 대한 설명으로 틀린 것은?",
      "infoChoice": [" 공정과 도구보다 개인과의 상호작용을 더 가치 있게 여긴다.", "동작하는 소프트웨어보다는 포괄적인 문서를 가치 있게 여긴다.", "계약 협상보다는 고객과의 협력을 가치 있게 여긴다", "계획을 따르기보다 변화에 대응하기를 가치 있게 여긴다."],
      "infoAnswer": "동작하는 소프트웨어보다는 포괄적인 문서를 가치 있게 여긴다.",
      "infoDesc": "프로젝트 요구사항은 '기능' 중심"
    },
    {
      "infoTime": "2022년 1회",
      "infoNumber": "20220305",
      "infoQuestion": " 소프트웨어 설계에서 요구사항 분석에 대한 설명으로 틀린 것은?",
      "infoChoice": [" 소프트웨어가 무엇을 해야하는가를 추적하여 요구사항 명세를 작성하는 작업이다.", "사용자의 요구를 추출하여 목표를 정하고 어떤 방식으로 해결할 것인지 결정하는 단계이다", "소프트웨어 시스템이 사용되는 동안 발견되는 오류를 정리하는 단계이다.", "소프트웨어 개발의 출발점이면서 실질적인 첫 번째 단계이다."],
      "infoAnswer": "소프트웨어 시스템이 사용되는 동안 발견되는 오류를 정리하는 단계이다.",
      "infoDesc": "소프트웨어 시스템이 사용되는 동안 발견되는 오류를 정리하는 단계는 테스트 단계이다."
    },
    {
      "infoTime": "2022년 1회",
      "infoNumber": "20220305",
      "infoQuestion": "객체지향 기법에서 상위 클래스의 메소드와 속성을 하위 클래스가 물려받는 것을 의미하는 것은?",
      "infoChoice": [" Abstraction", "Polymorphism", "Encapsulation", " Inheritance"],
      "infoAnswer": "Inheritance",
      "infoDesc": "속성과 연산 등을 물려주는 클래스를 상위 클래스 또는 슈퍼 클래스, 물려받는 클래스를 하위 클래스 또는 서브 클래스라고 한다."
    },
    {
      "infoTime": "2022년 1회",
      "infoNumber": "20220305",
      "infoQuestion": "설계 기법 중 하향식 설계 방법과 상향식 설계 방법에 대한 비교 설명으로 가장 옳지 않은 것은?",
      "infoChoice": ["하향식 설계에서는 통합 검사 시 인터페이스가 이미 정의되어 있어 통합이 간단하다.", " 하향식 설계에서 레벨이 낮은 데이터 구조의 세부 사항은 설계초기 단계에서 필요하다.", " 상향식 설계는 최하위 수준에서 각각의 모듈들을 설계하고 이러한 모듈이 완성되면 이들을 결합하여 검사한다.", "상향식 설계에서는 인터페이스가 이미 성립되어 있지 않더라도 기능 추가가 쉽다."],
      "infoAnswer": "상향식 설계에서는 인터페이스가 이미 성립되어 있지 않더라도 기능 추가가 쉽다.",
      "infoDesc": "상향식 설계는  전체적으로 이들을 결합하여 설계하는 방식으로 인터페이스가 이미 성립되어 있어야지 기능 추가가 쉽다. "
    }
  ]
}